music_app/app/views/albums/edit.html.erb

          <option value="0"<% " selected" if @album.band_id %>>Select a band...</option>
          <% bands = Band.all.order(:name) %>
---
SELECT "bands".* FROM "bands" ORDER BY "bands"."name" ASC