music_app/app/views/albums/new.html.erb

SELECT "bands".* FROM "bands" ORDER BY "bands"."name" ASC
---
          <option value="0" selected>Select a band...</option>
          <% bands = Band.all.order(:name) %>