music_app/app/controllers/albums_controller.rb

  def new
    @band = Band.find(params[:band_id])
---
SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]

  def create
    @album = Album.new(album_params)
    if @album.save
---
INSERT INTO "albums" ("title", "band_id", "live", "year", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "Speak & Spell"], ["band_id", 9], ["live", true], ["year", 1981], ["created_at", "2018-12-20 22:15:31.828511"], ["updated_at", "2018-12-20 22:15:31.828511"]]

  def update
    @album = Album.find(params[:id])
    if @album.update(album_params)
---
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "albums" SET "live" = $1, "updated_at" = $2 WHERE "albums"."id" = $3  [["live", false], ["updated_at", "2018-12-20 22:35:19.177164"], ["id", 1]]