music_app/app/controllers/bands_controller.rb

SELECT "bands".* FROM "bands" ORDER BY "bands"."name" ASC
---
  def index
    @bands = Band.all.order(:name)

INSERT INTO "bands" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "New Order"], ["created_at", "2018-12-20 20:34:43.265808"], ["updated_at", "2018-12-20 20:34:43.265808"]]
---
  def create
    band = Band.new(band_params)
    if band.save

SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "bands" SET "name" = $1, "updated_at" = $2 WHERE "bands"."id" = $3  [["name", "Depeche Modes"], ["updated_at", "2018-12-20 21:06:47.520102"], ["id", 1]]
---
  def update
    @band = Band.find(params[:id])
    if @band.update(band_params)

SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "bands" WHERE "bands"."id" = $1  [["id", 1]]
---
  def destroy
    @band = Band.find(params[:id])
    @band.delete