music_app/app/views/bands/show.html.erb

SELECT "albums".* FROM "albums" WHERE "albums"."band_id" = $1  [["band_id", 9]]
---
<p><a href="<%= edit_band_url(@band) %>">Edit Band</a></p>
<% if @band.albums.length > 0 %>